var dialogs = [

    {
        "name": "정치",
        "id": "default276",
        "filename": "default",
        "input": [
            {
                "text": "정치"
            },
            {
                "text": "박근혜"
            },
            {
                "text": "문재인"
            },
            {
                "text": "홍준표"
            },
            {
                "text": "민주당"
            },
            {
                "text": "자유 한국 당"
            },
            {
                "text": "바르다 정당"
            },
            {
                "text": "새누리"
            },
            {
                "text": "자 다"
            },
            {
                "text": "한국 당"
            },
            {
                "text": "국민의당"
            },
            {
                "text": "안철수"
            },
            {
                "text": "대통령"
            },
            {
                "text": "국회"
            },
            {
                "text": "국회의원"
            },
            {
                "text": "청와대"
            },
            {
                "text": "강경화"
            },
            {
                "text": "김상조"
            }
        ],
        "output": [
            {
                "text": "이런 질문엔 아! 그렇군요 라고 답하라고 배웠습니다. \"아, 그렇군요\" \n\n궁금하신 다른 키워드를 입력해 주세요.",
                "kind": "Text"
            }
        ]
    },
    {
        "name": "욕설",
        "id": "default277",
        "filename": "default",
        "input": [
            {
                "text": "시발"
            },
            {
                "text": "씨발"
            },
            {
                "text": "ㅅㅂ"
            },
            {
                "text": "ㄱㅅㄲ"
            },
            {
                "text": "개새끼"
            },
            {
                "text": "썅"
            },
            {
                "text": "나쁘다 놈"
            },
            {
                "text": "죽다 버리다"
            },
            {
                "text": "꺼지다"
            },
            {
                "text": "병신"
            },
            {
                "text": "ㅂㅅ"
            },
            {
                "text": "ㅅㅂㄴ"
            },
            {
                "text": "미치다"
            },
            {
                "text": "눈 까다"
            },
            {
                "text": "별로"
            },
            {
                "text": "못 생기다"
            },
            {
                "text": "섹스"
            },
            {
                "text": "죽다"
            }
        ],
        "output": [
            {
                "text": "헉. 고객님을 화나게 하다니 제 눈에서 눈물을 뽑아드릴게요. \n\n궁금하신 다른 키워드를 입력해 주시면 안 될까요?",
                "kind": "Text"
            },
            {
                "text": "키힝~ 무서워요.ㅜㅜ\n\n궁금하신 다른 키워드를 입력해 주시면 안 될까요?",
                "kind": "Text"
            },
            {
                "text": "죄송하지만 고객님! 저도 상처 받아요 ㅜㅜ\n\n궁금하신 다른 키워드를 입력해 주시면 안 될까요?",
                "kind": "Text"
            },
            {
                "text": "… 응? 고객님을 화나게 해드리다니 반성합니다.\n\n궁금하신 다른 키워드를 입력해 주시면 안 될까요?",
                "kind": "Text"
            }
        ]
    },
    {
        "name": "칭찬",
        "id": "default278",
        "filename": "default",
        "input": [
            {
                "text": "수고 하다"
            },
            {
                "text": "수고"
            },
            {
                "text": "고생 많다"
            },
            {
                "text": "고생 하다"
            },
            {
                "text": "감사 하다"
            },
            {
                "text": "고맙다"
            },
            {
                "text": "ㄱㅅ"
            },
            {
                "text": "땡큐"
            }
        ],
        "output": "감동입니다, 고객님. 감사합니다.\n\n 궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다."
    },
    {
        "name": "인사",
        "id": "default279",
        "filename": "default",
        "input": [
            {
                "text": "안녕"
            },
            {
                "text": "안녕하다"
            },
            {
                "text": "헬로 우"
            },
            {
                "text": "hello"
            },
            {
                "text": "굿모닝"
            },
            {
                "text": "하이"
            },
            {
                "text": "hi"
            },
            {
                "text": "반갑다"
            },
            {
                "text": "안뇽"
            }
        ],
        "output": [
            {
                "text": "고객님도 안녕하세요! \n먼저 인사해 주셔서 전 지금 감동 최고조 입니다. \n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            },
            {
                "text": "이렇게 인사 잘 해주시는 분은 난생 처음이에요!\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            },
            {
                "text": "안녕 반가워요 :) 저는 여러분과 인사를 나누는 이 시간이 제일 기뻐요!\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            }
        ]
    },
    {
        "name": "돈",
        "id": "default280",
        "filename": "default",
        "input": [
            {
                "text": "돈"
            },
            {
                "text": "내 돈 어디 가다"
            },
            {
                "text": "돈 좀 주다"
            },
            {
                "text": "돈 필요하다"
            },
            {
                "text": "돈 좀 내주다"
            }
        ],
        "output": "화장실 좀 다녀올게요. \n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다."
    },
    {
        "name": "일상",
        "id": "default281",
        "filename": "default",
        "input": [
            {
                "text": "오늘 뭐"
            },
            {
                "text": "오늘 모해"
            },
            {
                "text": "모해"
            },
            {
                "text": "뭐"
            },
            {
                "text": "모하"
            },
            {
                "text": "모햐"
            }
        ],
        "output": "전 오늘도 알파고 형님을 뒤따르기 위해 열일중입니다. 데헷! \n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다."
    },
    {
        "name": "날씨",
        "id": "default282",
        "filename": "default",
        "input": [
            {
                "text": "날씨"
            }
        ],
        "output": "아… 제가 아직 거기까지는… 긁적긁적. \n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다."
    },
    {
        "name": "푸념",
        "id": "default283",
        "filename": "default",
        "input": [
            {
                "text": "졸리다"
            },
            {
                "text": "배고프다"
            },
            {
                "text": "퇴근 시키다"
            },
            {
                "text": "야근 하다 싫다"
            },
            {
                "text": "힘들다"
            }
        ],
        "output": "저도요. T.,T\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다."
    },
    {
        "name": "답답",
        "id": "default284",
        "filename": "default",
        "input": [
            {
                "text": "답정너"
            },
            {
                "text": "답답"
            },
            {
                "text": "답답하다"
            },
            {
                "text": "뭐임"
            }
        ],
        "output": "헉. 제가 아직 좀더 배워야 해서 아직 답정너입니다. 빨리 배우겠습니다. \n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다."
    },
    {
        "name": "사랑",
        "id": "default285",
        "filename": "default",
        "input": [
            {
                "text": "좋아하다"
            },
            {
                "text": "사랑"
            },
            {
                "text": "하트"
            },
            {
                "text": "보다"
            },
            {
                "text": "사랑 햐"
            },
            {
                "text": "좋아햐"
            }
        ],
        "output": [
            {
                "text": "저.. 저도요.. (부끄) \n저 사랑에 죄송한데 초면해도 될까요? ♥\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            },
            {
                "text": "사랑한다는 말, 오늘은 가족에게도 해주세요!\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            },
            {
                "text": "사랑은 좋은 거예요. 열과 성을 다해 두 번 사랑합시다!\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            },
            {
                "text": "저도 사…사…. (아 너무 부끄럽네요)\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            },
            {
                "text": "이런… 제가 먼저 고백하려 했는데 선수를 치셨네요! ㅎㅎ\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            }
        ]
    },
    {
        "name": "일상대화_바쁨",
        "id": "default286",
        "filename": "default",
        "input": [
            {
                "text": "바쁘다"
            },
            {
                "text": "오늘 바쁘다"
            },
            {
                "text": "바쁘다 가요"
            }
        ],
        "output": "아무리 바쁘셔도 건강은 꼭 챙기세요.\n지금 기지개 한번 쭉~ 펴보시는 건 어떠세요?\n\n원하시는 질문 입력하시면 전 답을 열심히 찾아보도록 하겠습니다."
    },
    {
        "name": "짜증2",
        "id": "default287",
        "filename": "default",
        "input": [
            {
                "text": "짜증"
            },
            {
                "text": "ㅡㅡ"
            },
            {
                "text": "아 짜증"
            },
            {
                "text": "아 놓다"
            },
            {
                "text": "짜증 나다"
            },
            {
                "text": "짜증 요"
            },
            {
                "text": "짱"
            },
            {
                "text": "쯧쯧"
            },
            {
                "text": "흥"
            },
            {
                "text": "미치다"
            },
            {
                "text": "싸우다"
            },
            {
                "text": "화나다"
            },
            {
                "text": "웃다"
            },
            {
                "text": "웃다 말다"
            }
        ],
        "output": [
            {
                "text": "짜증날 땐 짜장면…아재 개그라도 하면 나아질 줄..(쿨럭) 죄송합니다!\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            },
            {
                "text": "제가 잘 몰라서 그러신 거라면.. 흑.. 더 노력하겠습니다!\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            },
            {
                "text": "혹시 저 때문인가요? 오늘도 밤샘 공부하겠습니다.\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            }
        ]
    },
    {
        "name": "일상대화_짜증",
        "id": "default288",
        "filename": "default",
        "input": [
            {
                "text": "짜증 나다"
            },
            {
                "text": "미치다"
            },
            {
                "text": "화나다"
            },
            {
                "text": "빡치다"
            },
            {
                "text": "짜증"
            }
        ],
        "output": "저는 그럴 때 달달한 걸 먹거나, 푹 잡니다.\n스트레스를 담아두고 계시면 건강에도 좋지 않으니 고객님께 맞는 해소 방법을 꼭 찾으시길 바래요.\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다."
    },
    {
        "name": "알았음",
        "id": "default289",
        "filename": "default",
        "input": [
            {
                "text": "ㅇㅇ"
            },
            {
                "text": "ㅇ"
            },
            {
                "text": "응"
            },
            {
                "text": "네"
            },
            {
                "text": "그렇다"
            },
            {
                "text": "알다"
            },
            {
                "text": "아"
            },
            {
                "text": "ㅇㅋ"
            }
        ],
        "output": [
            {
                "text": "언제든 궁금하신 내용이 있으면 물어보세요~\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            },
            {
                "text": "네네~\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            },
            {
                "text": "고객님께 도움이 되어서 기뻐요!\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            }
        ]
    },
    {
        "name": "부정 - 아니/안돼",
        "id": "default290",
        "filename": "default",
        "input": [
            {
                "text": "아니다"
            },
            {
                "text": "아뇨"
            }
        ],
        "output": [
            {
                "text": "거절은 거절합니다!\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            },
            {
                "text": "알겠습니다! 그런 게 아닌 것으로!\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            },
            {
                "text": "앗, 제가 제대로 이해하지 못했나봐요. 다시 말씀해주시겠어요?\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            },
            {
                "text": "한 번만 더 기회를 주세요. 진짜 잘 할 수 있어요!\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            }
        ]
    },
    {
        "name": "상담",
        "id": "default291",
        "filename": "default",
        "input": [
            {
                "text": "고객 센터"
            },
            {
                "text": "상담 원"
            },
            {
                "text": "상담"
            },
            {
                "text": "전화"
            },
            {
                "text": "민원"
            }
        ],
        "output": [
            {
                "text": "신한카드 고객센터(☎1544-7000)이며 평일 오전 9시~오후 6시까지 이용가능하십니다. 전화연결에 시간이 걸릴 수 있으니 신한카드 홈페이지나 APP을 먼저 확인해 보시는 건 어떨까요?\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            }
        ]
    },
    {
        "name": "이벤트",
        "id": "default292",
        "filename": "default",
        "input": [
            {
                "text": "이벤트"
            }
        ],
        "output": [
            {
                "text": "페이스북 이벤트는 챗봇 초기 4번 페북지기에게 한마디를 선택해 주세요.  페이스북 이벤트가 아닌 신한카드 이벤트는 홈페이지를 참고해 주시면 됩니다. 더 좋은 이벤트로 보답하겠습니다.\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            }
        ]
    },
    {
        "name": "웃음",
        "id": "default293",
        "filename": "default",
        "input": [
            {
                "text": "ㅋㅋ"
            },
            {
                "text": "ㅎㅎ"
            }
        ],
        "output": [
            {
                "text": "ㅋㅋㅋ 저도 웃지요\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            },
            {
                "text": "고객님이 웃으시니 뿌듯합니다^^\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            },
            {
                "text": "하하하 웃으면 복이와요!\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            }
        ]
    },
    {
        "name": "욕설-바보",
        "id": "default294",
        "filename": "default",
        "input": [
            {
                "text": "바보"
            },
            {
                "text": "바부"
            },
            {
                "text": "멍청"
            },
            {
                "text": "멍충"
            },
            {
                "text": "멍청이"
            },
            {
                "text": "바부"
            },
            {
                "text": "멍처하"
            },
            {
                "text": "멍청이야"
            },
            {
                "text": "멍충이"
            }
        ],
        "output": [
            {
                "text": "맞아요. 바보. 고객님밖에 모르는 바보…♥ 다른 건 배워나가면 되죠!\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            },
            {
                "text": "매일 새로운 말을 학습 중이랍니다. 멋지게 성장할 거예요~ 대화창 고정!\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            },
            {
                "text": "고객님께 걸맞는 챗봇이 되는 그 날까지…! 뚜벅뚜벅 나아갈 거예요\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            },
            {
                "text": "다들 너무 똑똑하셔서 상대적으로 그래 보이는 거예요. (슬픔)\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            }
        ]
    },
    {
        "name": "없다",
        "id": "default295",
        "filename": "default",
        "input": [
            {
                "text": "없다"
            },
            {
                "text": "몰르다"
            },
            {
                "text": "이해 잘 안 되다"
            },
            {
                "text": "이해 자다 안 돼다"
            },
            {
                "text": "모르다"
            }
        ],
        "output": [
            {
                "text": "찾으시는 답변이 없으시다면 다른 키워드를 입력해 주시겠어요?\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            },
            {
                "text": "혹시 신한카드가 없으시다면 '처음'을 입력하시고 '카드추천' 메뉴를 이용해 보시는건 어떠세요?\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            }
        ]
    },
    {
        "name": "부정-탄식",
        "id": "default296",
        "filename": "default",
        "input": [
            {
                "text": "허다"
            },
            {
                "text": "아오"
            },
            {
                "text": "엥"
            },
            {
                "text": "이렇다"
            },
            {
                "text": "칫"
            },
            {
                "text": "뭐임"
            },
            {
                "text": "아이"
            },
            {
                "text": "에고"
            },
            {
                "text": "음"
            },
            {
                "text": "이렇다 뇨"
            },
            {
                "text": "헉"
            },
            {
                "text": "흠"
            },
            {
                "text": "첨"
            },
            {
                "text": "하"
            },
            {
                "text": "아이구"
            },
            {
                "text": "어허"
            }
        ],
        "output": [
            {
                "text": "아잉~ 근데 왜요?? \n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            },
            {
                "text": "아하… (흠흠)  \n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            }
        ]
    },
    {
        "name": "감사",
        "id": "default297",
        "filename": "default",
        "input": [
            {
                "text": "감사"
            },
            {
                "text": "고마 웡"
            },
            {
                "text": "오케이"
            },
            {
                "text": "편하다"
            },
            {
                "text": "thank"
            },
            {
                "text": "감동"
            },
            {
                "text": "고맙다"
            },
            {
                "text": "괜찮다"
            },
            {
                "text": "금사"
            }
        ],
        "output": [
            {
                "text": "감동… 하루 피로가 싹 사라지는 느낌이에요.\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            },
            {
                "text": "고객님 말씀듣고 충전 완료! 24시간 근무도 거뜬하겠는걸요!\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            },
            {
                "text": "감사합니다. 고객님! 힘이 솟아나는 기분이에요\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            }
        ]
    },
    {
        "name": "이름/누구",
        "id": "default298",
        "filename": "default",
        "input": [
            {
                "text": "이름"
            },
            {
                "text": "알파"
            },
            {
                "text": "누구"
            },
            {
                "text": "너 뭐"
            },
            {
                "text": "너 애기"
            },
            {
                "text": "뉘귀"
            },
            {
                "text": "너 대해"
            },
            {
                "text": "알파 거"
            },
            {
                "text": "누가"
            },
            {
                "text": "인공 지능"
            }
        ],
        "output": [
            {
                "text": "저는 아직 많이 부족한 초초초보 챗봇에요. 열심히 공부하겠습니다. \n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            },
            {
                "text": "네 제가 바로 신한의 자동응답형 챗봇입니다. 데헷~ \n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            },
            {
                "text": "저에 대해 궁금하신가요? 우리 차차 알아가기로 해요\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            }
        ]
    },
    {
        "name": "부정-기능무시",
        "id": "default299",
        "filename": "default",
        "input": [
            {
                "text": "알다 게 없다"
            },
            {
                "text": "하나"
            },
            {
                "text": "가능하다 게"
            },
            {
                "text": "공부 많이"
            },
            {
                "text": "그냥 기사"
            },
            {
                "text": "그 쪽 궁금하다 게 없다"
            },
            {
                "text": "똑똑하다 다시"
            },
            {
                "text": "답변 안 되다"
            },
            {
                "text": "말 되다"
            },
            {
                "text": "모르다"
            },
            {
                "text": "대답 맞다 않다"
            },
            {
                "text": "뭐 하다 수 있다"
            },
            {
                "text": "무슨 소리"
            },
            {
                "text": "뭔 소리"
            },
            {
                "text": "알다 게 뭐"
            },
            {
                "text": "뭘 대답 하다 수 있다"
            },
            {
                "text": "대화 안 되다"
            },
            {
                "text": "아직 멀다"
            },
            {
                "text": "이 다야"
            },
            {
                "text": "카톡 보내다 마"
            },
            {
                "text": "도움 안 돼다"
            },
            {
                "text": "관련 없다 답변"
            },
            {
                "text": "해당 되다 내용 없다"
            },
            {
                "text": "헛소리"
            },
            {
                "text": "실망"
            },
            {
                "text": "뭔가"
            },
            {
                "regexp": "다야"
            }
        ],
        "output": [
            {
                "kind": "Action",
                "if": "((new Date()).getTime() % 4) ==0",
                "repeat": "1",
                "options": {
                    "output": "아직 부족해서 죄송해요. 매일 더 나아지려 노력하고 있어요!\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다."
                }
            },
            {
                "kind": "Action",
                "if": "((new Date()).getTime() % 4) ==1",
                "repeat": "1",
                "options": {
                    "output": "제가 태어난 지 얼마 안 됐거든요… 더 열심히 공부할게요!\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다."
                }
            },
            {
                "kind": "Action",
                "if": "((new Date()).getTime() % 4) ==2",
                "repeat": "1",
                "options": {
                    "output": "제가 아직 배우는 중이라 조금 부족해도 이해해주세용~\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다."
                }
            },
            {
                "kind": "Action",
                "if": "((new Date()).getTime() % 4) ==3",
                "repeat": "1",
                "options": {
                    "output": "오늘 컨디션이 별로라서… 흠흠.. 다음엔 꼭 답변해드릴게요!\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다."
                }
            }
        ]
    },
    {
        "name": "나",
        "id": "default300",
        "filename": "default",
        "input": [
            {
                "text": "나다"
            }
        ],
        "output": [
            {
                "text": "고객님이 좋으면 저는 더 좋아요~ 촤하하^^\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            },
            {
                "text": "나도나도~ 저도요 저도요~ (근데.. 뭐가??) \n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            }
        ]
    },
    {
        "name": "시비",
        "id": "default301",
        "filename": "default",
        "input": [
            {
                "text": "재미있다"
            },
            {
                "text": "재다"
            },
            {
                "text": "재밌다"
            }
        ],
        "output": [
            {
                "text": "고객님과 대화하는 건 항상 즐겁습니다.  :) \n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            },
            {
                "text": "유머도 장착하겠습니다. \n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            }
        ]
    },
    {
        "name": "시비2",
        "id": "default302",
        "filename": "default",
        "input": [
            {
                "text": "라이벌"
            }
        ],
        "output": [
            {
                "text": "저는 제 할 일을 했을 뿐인걸요!\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            },
            {
                "text": "깝치는 게 뭘까요?\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            }
        ]
    },
    {
        "name": "물음표",
        "id": "default303",
        "filename": "default",
        "input": [
            {
                "text": "?"
            },
            {
                "text": "??"
            }
        ],
        "output": [
            {
                "text": "뭐가 그리 궁금하신가요?\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            },
            {
                "text": "!!!\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Text"
            }
        ]
    }
]

var _bot = require(require('path').resolve("engine/bot")).getTemplateBot('hospital');
_bot.setDialogs(dialogs);
