

var slangQuibbles=
{ condition: {words: ['개새끼', '시발', '씨발', '개놈', '쌍', '좆', '멍 청', '멍충', '바보']},
  sentences: [
    '고운 말만 해주세요.',
    '괜히 욕해도 저는 사람이 아니기 때문에 기분 나쁘지가 않습니다.',
    '국정원에 연락할까요?',
    '그러지 마세요.',
    '그런 욕 하지 마세요.',
    '그런 저급한 단어는 입에 담지 말았으면 합니다.',
    '그런 험한 말 쓰면 안되요.',
    '나쁜 말 하면 안 좋습니다.',
    '나쁜 말은 다 되돌아 갑니다.',
    '다시 한번 말해주시겠어요?',
    '민형사상의 책임을 지실 수 있나요?',
    '사람이 고운 말만 써야죠.',
    '아무리 화가 나도 그래도 대통령이었던 사람한테.',
    '아이고 그렇게 험한 말을 왜 저한테.',
    '안 그러시면 안될까요?',
    '예쁜 말을 해야지 피부도 좋아지고 예뻐집니다.',
    '왜 그렇게 이야기 하시죠?',
    '왜 말을 막하세요?',
    '왜 제가 그런 말을 들어야 하죠?',
    '욕 같은 건 다 자기한테 돌아옵니다.',
    '욕 하셨어요?',
    '욕은 아꼈다가 나중에 서면으로 해주세요.',
    '욕은 이런 데에 하는 게 아니죠.',
    '욕을 왜 하고 그러세요.',
    '욕이 심하신 것 같습니다.',
    '저는 그냥 프로그램이예요.',
    '저는 실제 인물이 아니예요.',
    '저보고 일해라 절해라 하지 마세요.',
    '저한테 하시기엔 부적절한 말씀 같습니다.',
    '저한테 하신 말씀이세요?',
    '제가 그런 얘기 듣는다고 뭐 달라지나요?',
    '제가 지금 그런 이야기를 듣고 다 참고 있는 걸 보면서 좀 느끼시라고 가만히 있는 것 뿐입니다.',
    '저도 사람인데 이런 이야기에 또 다 그렇게 대응하면 국민들 보시기에 그런 게 다 있으니까 좀 자제해주세요.',
    '지금 저한테 그러셨어요?',
    '지금 저한테 목욕감을 주셨어요.',
    '지금 제게 임신공격 하셨나요?'
]};



