var dialogs = [
    {
        "name": "정치",
        "id": "default276",
        "filename": "default",
        "input": [
            {
                "text": {
                    "raw": "정치",
                    "nlp": "정치"
                }
            },
            {
                "text": {
                    "raw": "박근혜",
                    "nlp": "박근혜"
                }
            },
            {
                "text": {
                    "raw": "문재인",
                    "nlp": "문재인"
                }
            },
            {
                "text": {
                    "raw": "홍준표",
                    "nlp": "홍준표"
                }
            },
            {
                "text": {
                    "raw": "민주당",
                    "nlp": "민주당"
                }
            },
            {
                "text": {
                    "raw": "자유 한국 당",
                    "nlp": "자유 한국 당"
                }
            },
            {
                "text": {
                    "raw": "바르다 정당",
                    "nlp": "바르다 정당"
                }
            },
            {
                "text": {
                    "raw": "새누리",
                    "nlp": "새누리"
                }
            },
            {
                "text": {
                    "raw": "자 다",
                    "nlp": "자 다"
                }
            },
            {
                "text": {
                    "raw": "한국 당",
                    "nlp": "한국 당"
                }
            },
            {
                "text": {
                    "raw": "국민의당",
                    "nlp": "국민의당"
                }
            },
            {
                "text": {
                    "raw": "안철수",
                    "nlp": "안철수"
                }
            },
            {
                "text": {
                    "raw": "대통령",
                    "nlp": "대통령"
                }
            },
            {
                "text": {
                    "raw": "국회",
                    "nlp": "국회"
                }
            },
            {
                "text": {
                    "raw": "국회의원",
                    "nlp": "국회의원"
                }
            },
            {
                "text": {
                    "raw": "청와대",
                    "nlp": "청와대"
                }
            },
            {
                "text": {
                    "raw": "강경화",
                    "nlp": "강경화"
                }
            },
            {
                "text": {
                    "raw": "김상조",
                    "nlp": "김상조"
                }
            }
        ],
        "output": [
            {
                "text": "이런 질문엔 아! 그렇군요 라고 답하라고 배웠습니다. \"아, 그렇군요\" \n\n궁금하신 다른 키워드를 입력해 주세요.",
                "kind": "Content"
            }
        ]
    },
    {
        "name": "욕설",
        "id": "default277",
        "filename": "default",
        "input": [
            {
                "text": {
                    "raw": "시발",
                    "nlp": "시발"
                }
            },
            {
                "text": {
                    "raw": "씨발",
                    "nlp": "씨발"
                }
            },
            {
                "text": {
                    "raw": "ㅅㅂ",
                    "nlp": "ㅅㅂ"
                }
            },
            {
                "text": {
                    "raw": "ㄱㅅㄲ",
                    "nlp": "ㄱㅅㄲ"
                }
            },
            {
                "text": {
                    "raw": "개새끼",
                    "nlp": "개새끼"
                }
            },
            {
                "text": {
                    "raw": "썅",
                    "nlp": "썅"
                }
            },
            {
                "text": {
                    "raw": "나쁘다 놈",
                    "nlp": "나쁘다 놈"
                }
            },
            {
                "text": {
                    "raw": "죽다 버리다",
                    "nlp": "죽다 버리다"
                }
            },
            {
                "text": {
                    "raw": "꺼지다",
                    "nlp": "꺼지다"
                }
            },
            {
                "text": {
                    "raw": "병신",
                    "nlp": "병신"
                }
            },
            {
                "text": {
                    "raw": "ㅂㅅ",
                    "nlp": "ㅂㅅ"
                }
            },
            {
                "text": {
                    "raw": "ㅅㅂㄴ",
                    "nlp": "ㅅㅂㄴ"
                }
            },
            {
                "text": {
                    "raw": "미치다",
                    "nlp": "미치다"
                }
            },
            {
                "text": {
                    "raw": "눈 까다",
                    "nlp": "눈 까다"
                }
            },
            {
                "text": {
                    "raw": "별로",
                    "nlp": "별로"
                }
            },
            {
                "text": {
                    "raw": "못 생기다",
                    "nlp": "못 생기다"
                }
            },
            {
                "text": {
                    "raw": "섹스",
                    "nlp": "섹스"
                }
            },
            {
                "text": {
                    "raw": "죽다",
                    "nlp": "죽다"
                }
            }
        ],
        "output": [
            {
                "text": "헉. 고객님을 화나게 하다니 제 눈에서 눈물을 뽑아드릴게요. \n\n궁금하신 다른 키워드를 입력해 주시면 안 될까요?",
                "kind": "Content"
            },
            {
                "text": "키힝~ 무서워요.ㅜㅜ\n\n궁금하신 다른 키워드를 입력해 주시면 안 될까요?",
                "kind": "Content"
            },
            {
                "text": "죄송하지만 고객님! 저도 상처 받아요 ㅜㅜ\n\n궁금하신 다른 키워드를 입력해 주시면 안 될까요?",
                "kind": "Content"
            },
            {
                "text": "… 응? 고객님을 화나게 해드리다니 반성합니다.\n\n궁금하신 다른 키워드를 입력해 주시면 안 될까요?",
                "kind": "Content"
            }
        ]
    },
    {
        "name": "칭찬",
        "id": "default278",
        "filename": "default",
        "input": [
            {
                "text": {
                    "raw": "수고 하다",
                    "nlp": "수고 하다"
                }
            },
            {
                "text": {
                    "raw": "수고",
                    "nlp": "수고"
                }
            },
            {
                "text": {
                    "raw": "고생 많다",
                    "nlp": "고생 많다"
                }
            },
            {
                "text": {
                    "raw": "고생 하다",
                    "nlp": "고생 하다"
                }
            },
            {
                "text": {
                    "raw": "감사 하다",
                    "nlp": "감사 하다"
                }
            },
            {
                "text": {
                    "raw": "고맙다",
                    "nlp": "고맙다"
                }
            },
            {
                "text": {
                    "raw": "ㄱㅅ",
                    "nlp": "ㄱㅅ"
                }
            },
            {
                "text": {
                    "raw": "땡큐",
                    "nlp": "땡큐"
                }
            }
        ],
        "output": "감동입니다, 고객님. 감사합니다.\n\n 궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다."
    },
    {
        "name": "인사",
        "id": "default279",
        "filename": "default",
        "input": [
            {
                "text": {
                    "raw": "안녕",
                    "nlp": "안녕"
                }
            },
            {
                "text": {
                    "raw": "안녕하다",
                    "nlp": "안녕하다"
                }
            },
            {
                "text": {
                    "raw": "헬로 우",
                    "nlp": "헬로 우"
                }
            },
            {
                "text": {
                    "raw": "hello",
                    "nlp": "hello"
                }
            },
            {
                "text": {
                    "raw": "굿모닝",
                    "nlp": "굿모닝"
                }
            },
            {
                "text": {
                    "raw": "하이",
                    "nlp": "하이"
                }
            },
            {
                "text": {
                    "raw": "hi",
                    "nlp": "hi"
                }
            },
            {
                "text": {
                    "raw": "반갑다",
                    "nlp": "반갑다"
                }
            },
            {
                "text": {
                    "raw": "안뇽",
                    "nlp": "안뇽"
                }
            }
        ],
        "output": [
            {
                "text": "고객님도 안녕하세요! \n먼저 인사해 주셔서 전 지금 감동 최고조 입니다. \n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            },
            {
                "text": "이렇게 인사 잘 해주시는 분은 난생 처음이에요!\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            },
            {
                "text": "안녕 반가워요 :) 저는 여러분과 인사를 나누는 이 시간이 제일 기뻐요!\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            }
        ]
    },
    {
        "name": "돈",
        "id": "default280",
        "filename": "default",
        "input": [
            {
                "text": {
                    "raw": "돈",
                    "nlp": "돈"
                }
            },
            {
                "text": {
                    "raw": "내 돈 어디 가다",
                    "nlp": "내 돈 어디 가다"
                }
            },
            {
                "text": {
                    "raw": "돈 좀 주다",
                    "nlp": "돈 좀 주다"
                }
            },
            {
                "text": {
                    "raw": "돈 필요하다",
                    "nlp": "돈 필요하다"
                }
            },
            {
                "text": {
                    "raw": "돈 좀 내주다",
                    "nlp": "돈 좀 내주다"
                }
            }
        ],
        "output": "화장실 좀 다녀올게요. \n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다."
    },
    {
        "name": "일상",
        "id": "default281",
        "filename": "default",
        "input": [
            {
                "text": {
                    "raw": "오늘 뭐",
                    "nlp": "오늘 뭐"
                }
            },
            {
                "text": {
                    "raw": "오늘 모해",
                    "nlp": "오늘 모해"
                }
            },
            {
                "text": {
                    "raw": "모해",
                    "nlp": "모해"
                }
            },
            {
                "text": {
                    "raw": "뭐",
                    "nlp": "뭐"
                }
            },
            {
                "text": {
                    "raw": "모하",
                    "nlp": "모하"
                }
            },
            {
                "text": {
                    "raw": "모햐",
                    "nlp": "모햐"
                }
            }
        ],
        "output": "전 오늘도 알파고 형님을 뒤따르기 위해 열일중입니다. 데헷! \n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다."
    },
    {
        "name": "날씨",
        "id": "default282",
        "filename": "default",
        "input": [
            {
                "text": {
                    "raw": "날씨",
                    "nlp": "날씨"
                }
            }
        ],
        "output": "아… 제가 아직 거기까지는… 긁적긁적. \n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다."
    },
    {
        "name": "푸념",
        "id": "default283",
        "filename": "default",
        "input": [
            {
                "text": {
                    "raw": "졸리다",
                    "nlp": "졸리다"
                }
            },
            {
                "text": {
                    "raw": "배고프다",
                    "nlp": "배고프다"
                }
            },
            {
                "text": {
                    "raw": "퇴근 시키다",
                    "nlp": "퇴근 시키다"
                }
            },
            {
                "text": {
                    "raw": "야근 하다 싫다",
                    "nlp": "야근 하다 싫다"
                }
            },
            {
                "text": {
                    "raw": "힘들다",
                    "nlp": "힘들다"
                }
            }
        ],
        "output": "저도요. T.,T\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다."
    },
    {
        "name": "답답",
        "id": "default284",
        "filename": "default",
        "input": [
            {
                "text": {
                    "raw": "답정너",
                    "nlp": "답정너"
                }
            },
            {
                "text": {
                    "raw": "답답",
                    "nlp": "답답"
                }
            },
            {
                "text": {
                    "raw": "답답하다",
                    "nlp": "답답하다"
                }
            },
            {
                "text": {
                    "raw": "뭐임",
                    "nlp": "뭐임"
                }
            }
        ],
        "output": "헉. 제가 아직 좀더 배워야 해서 아직 답정너입니다. 빨리 배우겠습니다. \n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다."
    },
    {
        "name": "사랑",
        "id": "default285",
        "filename": "default",
        "input": [
            {
                "text": {
                    "raw": "좋아하다",
                    "nlp": "좋아하다"
                }
            },
            {
                "text": {
                    "raw": "사랑",
                    "nlp": "사랑"
                }
            },
            {
                "text": {
                    "raw": "하트",
                    "nlp": "하트"
                }
            },
            {
                "text": {
                    "raw": "보다",
                    "nlp": "보다"
                }
            },
            {
                "text": {
                    "raw": "사랑 햐",
                    "nlp": "사랑 햐"
                }
            },
            {
                "text": {
                    "raw": "좋아햐",
                    "nlp": "좋아햐"
                }
            }
        ],
        "output": [
            {
                "text": "저.. 저도요.. (부끄) \n저 사랑에 죄송한데 초면해도 될까요? ♥\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            },
            {
                "text": "사랑한다는 말, 오늘은 가족에게도 해주세요!\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            },
            {
                "text": "사랑은 좋은 거예요. 열과 성을 다해 두 번 사랑합시다!\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            },
            {
                "text": "저도 사…사…. (아 너무 부끄럽네요)\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            },
            {
                "text": "이런… 제가 먼저 고백하려 했는데 선수를 치셨네요! ㅎㅎ\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            }
        ]
    },
    {
        "name": "일상대화_바쁨",
        "id": "default286",
        "filename": "default",
        "input": [
            {
                "text": {
                    "raw": "바쁘다",
                    "nlp": "바쁘다"
                }
            },
            {
                "text": {
                    "raw": "오늘 바쁘다",
                    "nlp": "오늘 바쁘다"
                }
            },
            {
                "text": {
                    "raw": "바쁘다 가요",
                    "nlp": "바쁘다 가요"
                }
            }
        ],
        "output": "아무리 바쁘셔도 건강은 꼭 챙기세요.\n지금 기지개 한번 쭉~ 펴보시는 건 어떠세요?\n\n원하시는 질문 입력하시면 전 답을 열심히 찾아보도록 하겠습니다."
    },
    {
        "name": "짜증2",
        "id": "default287",
        "filename": "default",
        "input": [
            {
                "text": {
                    "raw": "짜증",
                    "nlp": "짜증"
                }
            },
            {
                "text": {
                    "raw": "ㅡㅡ",
                    "nlp": "ㅡㅡ"
                }
            },
            {
                "text": {
                    "raw": "아 짜증",
                    "nlp": "아 짜증"
                }
            },
            {
                "text": {
                    "raw": "아 놓다",
                    "nlp": "아 놓다"
                }
            },
            {
                "text": {
                    "raw": "짜증 나다",
                    "nlp": "짜증 나다"
                }
            },
            {
                "text": {
                    "raw": "짜증 요",
                    "nlp": "짜증 요"
                }
            },
            {
                "text": {
                    "raw": "짱",
                    "nlp": "짱"
                }
            },
            {
                "text": {
                    "raw": "쯧쯧",
                    "nlp": "쯧쯧"
                }
            },
            {
                "text": {
                    "raw": "흥",
                    "nlp": "흥"
                }
            },
            {
                "text": {
                    "raw": "미치다",
                    "nlp": "미치다"
                }
            },
            {
                "text": {
                    "raw": "싸우다",
                    "nlp": "싸우다"
                }
            },
            {
                "text": {
                    "raw": "화나다",
                    "nlp": "화나다"
                }
            },
            {
                "text": {
                    "raw": "웃다",
                    "nlp": "웃다"
                }
            },
            {
                "text": {
                    "raw": "웃다 말다",
                    "nlp": "웃다 말다"
                }
            }
        ],
        "output": [
            {
                "text": "짜증날 땐 짜장면…아재 개그라도 하면 나아질 줄..(쿨럭) 죄송합니다!\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            },
            {
                "text": "제가 잘 몰라서 그러신 거라면.. 흑.. 더 노력하겠습니다!\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            },
            {
                "text": "혹시 저 때문인가요? 오늘도 밤샘 공부하겠습니다.\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            }
        ]
    },
    {
        "name": "일상대화_짜증",
        "id": "default288",
        "filename": "default",
        "input": [
            {
                "text": {
                    "raw": "짜증 나다",
                    "nlp": "짜증 나다"
                }
            },
            {
                "text": {
                    "raw": "미치다",
                    "nlp": "미치다"
                }
            },
            {
                "text": {
                    "raw": "화나다",
                    "nlp": "화나다"
                }
            },
            {
                "text": {
                    "raw": "빡치다",
                    "nlp": "빡치다"
                }
            },
            {
                "text": {
                    "raw": "짜증",
                    "nlp": "짜증"
                }
            }
        ],
        "output": "저는 그럴 때 달달한 걸 먹거나, 푹 잡니다.\n스트레스를 담아두고 계시면 건강에도 좋지 않으니 고객님께 맞는 해소 방법을 꼭 찾으시길 바래요.\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다."
    },
    {
        "name": "알았음",
        "id": "default289",
        "filename": "default",
        "input": [
            {
                "text": {
                    "raw": "ㅇㅇ",
                    "nlp": "ㅇㅇ"
                }
            },
            {
                "text": {
                    "raw": "ㅇ",
                    "nlp": "ㅇ"
                }
            },
            {
                "text": {
                    "raw": "응",
                    "nlp": "응"
                }
            },
            {
                "text": {
                    "raw": "네",
                    "nlp": "네"
                }
            },
            {
                "text": {
                    "raw": "그렇다",
                    "nlp": "그렇다"
                }
            },
            {
                "text": {
                    "raw": "알다",
                    "nlp": "알다"
                }
            },
            {
                "text": {
                    "raw": "아",
                    "nlp": "아"
                }
            },
            {
                "text": {
                    "raw": "ㅇㅋ",
                    "nlp": "ㅇㅋ"
                }
            }
        ],
        "output": [
            {
                "text": "언제든 궁금하신 내용이 있으면 물어보세요~\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            },
            {
                "text": "네네~\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            },
            {
                "text": "고객님께 도움이 되어서 기뻐요!\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            }
        ]
    },
    {
        "name": "부정 - 아니/안돼",
        "id": "default290",
        "filename": "default",
        "input": [
            {
                "text": {
                    "raw": "아니다",
                    "nlp": "아니다"
                }
            },
            {
                "text": {
                    "raw": "아뇨",
                    "nlp": "아뇨"
                }
            }
        ],
        "output": [
            {
                "text": "거절은 거절합니다!\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            },
            {
                "text": "알겠습니다! 그런 게 아닌 것으로!\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            },
            {
                "text": "앗, 제가 제대로 이해하지 못했나봐요. 다시 말씀해주시겠어요?\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            },
            {
                "text": "한 번만 더 기회를 주세요. 진짜 잘 할 수 있어요!\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            }
        ]
    },
    {
        "name": "상담",
        "id": "default291",
        "filename": "default",
        "input": [
            {
                "text": {
                    "raw": "고객 센터",
                    "nlp": "고객 센터"
                }
            },
            {
                "text": {
                    "raw": "상담 원",
                    "nlp": "상담 원"
                }
            },
            {
                "text": {
                    "raw": "상담",
                    "nlp": "상담"
                }
            },
            {
                "text": {
                    "raw": "전화",
                    "nlp": "전화"
                }
            },
            {
                "text": {
                    "raw": "민원",
                    "nlp": "민원"
                }
            }
        ],
        "output": [
            {
                "text": "신한카드 고객센터(☎1544-7000)이며 평일 오전 9시~오후 6시까지 이용가능하십니다. 전화연결에 시간이 걸릴 수 있으니 신한카드 홈페이지나 APP을 먼저 확인해 보시는 건 어떨까요?\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            }
        ]
    },
    {
        "name": "이벤트",
        "id": "default292",
        "filename": "default",
        "input": [
            {
                "text": {
                    "raw": "이벤트",
                    "nlp": "이벤트"
                }
            }
        ],
        "output": [
            {
                "text": "페이스북 이벤트는 챗봇 초기 4번 페북지기에게 한마디를 선택해 주세요.  페이스북 이벤트가 아닌 신한카드 이벤트는 홈페이지를 참고해 주시면 됩니다. 더 좋은 이벤트로 보답하겠습니다.\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            }
        ]
    },
    {
        "name": "웃음",
        "id": "default293",
        "filename": "default",
        "input": [
            {
                "text": {
                    "raw": "ㅋㅋ",
                    "nlp": "ㅋㅋ"
                }
            },
            {
                "text": {
                    "raw": "ㅎㅎ",
                    "nlp": "ㅎㅎ"
                }
            }
        ],
        "output": [
            {
                "text": "ㅋㅋㅋ 저도 웃지요\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            },
            {
                "text": "고객님이 웃으시니 뿌듯합니다^^\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            },
            {
                "text": "하하하 웃으면 복이와요!\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            }
        ]
    },
    {
        "name": "욕설-바보",
        "id": "default294",
        "filename": "default",
        "input": [
            {
                "text": {
                    "raw": "바보",
                    "nlp": "바보"
                }
            },
            {
                "text": {
                    "raw": "바부",
                    "nlp": "바부"
                }
            },
            {
                "text": {
                    "raw": "멍청",
                    "nlp": "멍청"
                }
            },
            {
                "text": {
                    "raw": "멍충",
                    "nlp": "멍충"
                }
            },
            {
                "text": {
                    "raw": "멍청이",
                    "nlp": "멍청이"
                }
            },
            {
                "text": {
                    "raw": "바부",
                    "nlp": "바부"
                }
            },
            {
                "text": {
                    "raw": "멍처하",
                    "nlp": "멍처하"
                }
            },
            {
                "text": {
                    "raw": "멍청이야",
                    "nlp": "멍청이야"
                }
            },
            {
                "text": {
                    "raw": "멍충이",
                    "nlp": "멍충이"
                }
            }
        ],
        "output": [
            {
                "text": "맞아요. 바보. 고객님밖에 모르는 바보…♥ 다른 건 배워나가면 되죠!\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            },
            {
                "text": "매일 새로운 말을 학습 중이랍니다. 멋지게 성장할 거예요~ 대화창 고정!\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            },
            {
                "text": "고객님께 걸맞는 챗봇이 되는 그 날까지…! 뚜벅뚜벅 나아갈 거예요\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            },
            {
                "text": "다들 너무 똑똑하셔서 상대적으로 그래 보이는 거예요. (슬픔)\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            }
        ]
    },
    {
        "name": "없다",
        "id": "default295",
        "filename": "default",
        "input": [
            {
                "text": {
                    "raw": "없다",
                    "nlp": "없다"
                }
            },
            {
                "text": {
                    "raw": "몰르다",
                    "nlp": "몰르다"
                }
            },
            {
                "text": {
                    "raw": "이해 잘 안 되다",
                    "nlp": "이해 잘 안 되다"
                }
            },
            {
                "text": {
                    "raw": "이해 자다 안 돼다",
                    "nlp": "이해 자다 안 돼다"
                }
            },
            {
                "text": {
                    "raw": "모르다",
                    "nlp": "모르다"
                }
            }
        ],
        "output": [
            {
                "text": "찾으시는 답변이 없으시다면 다른 키워드를 입력해 주시겠어요?\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            },
            {
                "text": "혹시 신한카드가 없으시다면 '처음'을 입력하시고 '카드추천' 메뉴를 이용해 보시는건 어떠세요?\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            }
        ]
    },
    {
        "name": "부정-탄식",
        "id": "default296",
        "filename": "default",
        "input": [
            {
                "text": {
                    "raw": "허다",
                    "nlp": "허다"
                }
            },
            {
                "text": {
                    "raw": "아오",
                    "nlp": "아오"
                }
            },
            {
                "text": {
                    "raw": "엥",
                    "nlp": "엥"
                }
            },
            {
                "text": {
                    "raw": "이렇다",
                    "nlp": "이렇다"
                }
            },
            {
                "text": {
                    "raw": "칫",
                    "nlp": "칫"
                }
            },
            {
                "text": {
                    "raw": "뭐임",
                    "nlp": "뭐임"
                }
            },
            {
                "text": {
                    "raw": "아이",
                    "nlp": "아이"
                }
            },
            {
                "text": {
                    "raw": "에고",
                    "nlp": "에고"
                }
            },
            {
                "text": {
                    "raw": "음",
                    "nlp": "음"
                }
            },
            {
                "text": {
                    "raw": "이렇다 뇨",
                    "nlp": "이렇다 뇨"
                }
            },
            {
                "text": {
                    "raw": "헉",
                    "nlp": "헉"
                }
            },
            {
                "text": {
                    "raw": "흠",
                    "nlp": "흠"
                }
            },
            {
                "text": {
                    "raw": "첨",
                    "nlp": "첨"
                }
            },
            {
                "text": {
                    "raw": "하",
                    "nlp": "하"
                }
            },
            {
                "text": {
                    "raw": "아이구",
                    "nlp": "아이구"
                }
            },
            {
                "text": {
                    "raw": "어허",
                    "nlp": "어허"
                }
            }
        ],
        "output": [
            {
                "text": "아잉~ 근데 왜요?? \n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            },
            {
                "text": "아하… (흠흠)  \n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            }
        ]
    },
    {
        "name": "감사",
        "id": "default297",
        "filename": "default",
        "input": [
            {
                "text": {
                    "raw": "감사",
                    "nlp": "감사"
                }
            },
            {
                "text": {
                    "raw": "고마 웡",
                    "nlp": "고마 웡"
                }
            },
            {
                "text": {
                    "raw": "오케이",
                    "nlp": "오케이"
                }
            },
            {
                "text": {
                    "raw": "편하다",
                    "nlp": "편하다"
                }
            },
            {
                "text": {
                    "raw": "thank",
                    "nlp": "thank"
                }
            },
            {
                "text": {
                    "raw": "감동",
                    "nlp": "감동"
                }
            },
            {
                "text": {
                    "raw": "고맙다",
                    "nlp": "고맙다"
                }
            },
            {
                "text": {
                    "raw": "괜찮다",
                    "nlp": "괜찮다"
                }
            },
            {
                "text": {
                    "raw": "금사",
                    "nlp": "금사"
                }
            }
        ],
        "output": [
            {
                "text": "감동… 하루 피로가 싹 사라지는 느낌이에요.\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            },
            {
                "text": "고객님 말씀듣고 충전 완료! 24시간 근무도 거뜬하겠는걸요!\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            },
            {
                "text": "감사합니다. 고객님! 힘이 솟아나는 기분이에요\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            }
        ]
    },
    {
        "name": "이름/누구",
        "id": "default298",
        "filename": "default",
        "input": [
            {
                "text": {
                    "raw": "이름",
                    "nlp": "이름"
                }
            },
            {
                "text": {
                    "raw": "알파",
                    "nlp": "알파"
                }
            },
            {
                "text": {
                    "raw": "누구",
                    "nlp": "누구"
                }
            },
            {
                "text": {
                    "raw": "너 뭐",
                    "nlp": "너 뭐"
                }
            },
            {
                "text": {
                    "raw": "너 애기",
                    "nlp": "너 애기"
                }
            },
            {
                "text": {
                    "raw": "뉘귀",
                    "nlp": "뉘귀"
                }
            },
            {
                "text": {
                    "raw": "너 대해",
                    "nlp": "너 대해"
                }
            },
            {
                "text": {
                    "raw": "알파 거",
                    "nlp": "알파 거"
                }
            },
            {
                "text": {
                    "raw": "누가",
                    "nlp": "누가"
                }
            },
            {
                "text": {
                    "raw": "인공 지능",
                    "nlp": "인공 지능"
                }
            }
        ],
        "output": [
            {
                "text": "저는 아직 많이 부족한 초초초보 챗봇에요. 열심히 공부하겠습니다. \n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            },
            {
                "text": "네 제가 바로 신한의 자동응답형 챗봇입니다. 데헷~ \n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            },
            {
                "text": "저에 대해 궁금하신가요? 우리 차차 알아가기로 해요\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            }
        ]
    },
    {
        "name": "부정-기능무시",
        "id": "default299",
        "filename": "default",
        "input": [
            {
                "text": {
                    "raw": "알다 게 없다",
                    "nlp": "알다 게 없다"
                }
            },
            {
                "text": {
                    "raw": "하나",
                    "nlp": "하나"
                }
            },
            {
                "text": {
                    "raw": "가능하다 게",
                    "nlp": "가능하다 게"
                }
            },
            {
                "text": {
                    "raw": "공부 많이",
                    "nlp": "공부 많이"
                }
            },
            {
                "text": {
                    "raw": "그냥 기사",
                    "nlp": "그냥 기사"
                }
            },
            {
                "text": {
                    "raw": "그 쪽 궁금하다 게 없다",
                    "nlp": "그 쪽 궁금하다 게 없다"
                }
            },
            {
                "text": {
                    "raw": "똑똑하다 다시",
                    "nlp": "똑똑하다 다시"
                }
            },
            {
                "text": {
                    "raw": "답변 안 되다",
                    "nlp": "답변 안 되다"
                }
            },
            {
                "text": {
                    "raw": "말 되다",
                    "nlp": "말 되다"
                }
            },
            {
                "text": {
                    "raw": "모르다",
                    "nlp": "모르다"
                }
            },
            {
                "text": {
                    "raw": "대답 맞다 않다",
                    "nlp": "대답 맞다 않다"
                }
            },
            {
                "text": {
                    "raw": "뭐 하다 수 있다",
                    "nlp": "뭐 하다 수 있다"
                }
            },
            {
                "text": {
                    "raw": "무슨 소리",
                    "nlp": "무슨 소리"
                }
            },
            {
                "text": {
                    "raw": "뭔 소리",
                    "nlp": "뭔 소리"
                }
            },
            {
                "text": {
                    "raw": "알다 게 뭐",
                    "nlp": "알다 게 뭐"
                }
            },
            {
                "text": {
                    "raw": "뭘 대답 하다 수 있다",
                    "nlp": "뭘 대답 하다 수 있다"
                }
            },
            {
                "text": {
                    "raw": "대화 안 되다",
                    "nlp": "대화 안 되다"
                }
            },
            {
                "text": {
                    "raw": "아직 멀다",
                    "nlp": "아직 멀다"
                }
            },
            {
                "text": {
                    "raw": "이 다야",
                    "nlp": "이 다야"
                }
            },
            {
                "text": {
                    "raw": "카톡 보내다 마",
                    "nlp": "카톡 보내다 마"
                }
            },
            {
                "text": {
                    "raw": "도움 안 돼다",
                    "nlp": "도움 안 돼다"
                }
            },
            {
                "text": {
                    "raw": "관련 없다 답변",
                    "nlp": "관련 없다 답변"
                }
            },
            {
                "text": {
                    "raw": "해당 되다 내용 없다",
                    "nlp": "해당 되다 내용 없다"
                }
            },
            {
                "text": {
                    "raw": "헛소리",
                    "nlp": "헛소리"
                }
            },
            {
                "text": {
                    "raw": "실망",
                    "nlp": "실망"
                }
            },
            {
                "text": {
                    "raw": "뭔가",
                    "nlp": "뭔가"
                }
            },
            {
                "regexp": "다야"
            }
        ],
        "output": [
            {
                "kind": "Action",
                "if": "((new Date()).getTime() % 4) ==0",
                "options": {
                    "output": "아직 부족해서 죄송해요. 매일 더 나아지려 노력하고 있어요!\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다."
                },
                "type": "repeat"
            },
            {
                "kind": "Action",
                "if": "((new Date()).getTime() % 4) ==1",
                "options": {
                    "output": "제가 태어난 지 얼마 안 됐거든요… 더 열심히 공부할게요!\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다."
                },
                "type": "repeat"
            },
            {
                "kind": "Action",
                "if": "((new Date()).getTime() % 4) ==2",
                "options": {
                    "output": "제가 아직 배우는 중이라 조금 부족해도 이해해주세용~\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다."
                },
                "type": "repeat"
            },
            {
                "kind": "Action",
                "if": "((new Date()).getTime() % 4) ==3",
                "options": {
                    "output": "오늘 컨디션이 별로라서… 흠흠.. 다음엔 꼭 답변해드릴게요!\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다."
                },
                "type": "repeat"
            }
        ]
    },
    {
        "name": "나",
        "id": "default300",
        "filename": "default",
        "input": [
            {
                "text": {
                    "raw": "나다",
                    "nlp": "나다"
                }
            }
        ],
        "output": [
            {
                "text": "고객님이 좋으면 저는 더 좋아요~ 촤하하^^\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            },
            {
                "text": "나도나도~ 저도요 저도요~ (근데.. 뭐가??) \n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            }
        ]
    },
    {
        "name": "시비",
        "id": "default301",
        "filename": "default",
        "input": [
            {
                "text": {
                    "raw": "재미있다",
                    "nlp": "재미있다"
                }
            },
            {
                "text": {
                    "raw": "재다",
                    "nlp": "재다"
                }
            },
            {
                "text": {
                    "raw": "재밌다",
                    "nlp": "재밌다"
                }
            }
        ],
        "output": [
            {
                "text": "고객님과 대화하는 건 항상 즐겁습니다.  :) \n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            },
            {
                "text": "유머도 장착하겠습니다. \n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            }
        ]
    },
    {
        "name": "시비2",
        "id": "default302",
        "filename": "default",
        "input": [
            {
                "text": {
                    "raw": "라이벌",
                    "nlp": "라이벌"
                }
            }
        ],
        "output": [
            {
                "text": "저는 제 할 일을 했을 뿐인걸요!\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            },
            {
                "text": "깝치는 게 뭘까요?\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            }
        ]
    },
    {
        "name": "물음표",
        "id": "default303",
        "filename": "default",
        "input": [
            {
                "text": {
                    "raw": "?",
                    "nlp": "?"
                }
            },
            {
                "text": {
                    "raw": "??",
                    "nlp": "??"
                }
            }
        ],
        "output": [
            {
                "text": "뭐가 그리 궁금하신가요?\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            },
            {
                "text": "!!!\n\n궁금하신 다른 키워드를 입력해 주세요. 알파고처럼 대답하겠습니다.",
                "kind": "Content"
            }
        ]
    },
    {
        "name": "99",
        "input": [
            {
                "if": "true"
            }
        ],
        "output": [
            {
                "kind": "Content",
                "text": "죄송해요 알아듣지 못했습니다ㅜㅜ 필요하신 내용은 바로 전화로 문의하실 수 있어요!\n\n +bot.name+ ) 02-858-5683\n\n처음으로 가려면“시작“이라고 입력해주세요. "
            }
        ],
        "id": "default137",
        "task": {
            "name": "addbuttons"
        }
    }
];

module.exports = function(bot)
{
    bot.setDialogs(dialogs);
};
